app/views/posts/show.html.erb

<p>
  <strong class="comments">Comments (<%= @post.comments.size %>):</strong>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]