app/controllers/comments_controller.rb

    def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "joh thats hectic"], ["post_id", 1], ["created_at", "2020-08-13 10:56:51.828695"], ["updated_at", "2020-08-13 10:56:51.828695"]]