app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)

        if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "my topic today"], ["content", "hi there I'm typing this today about thius topic\r\n"], ["created_at", "2020-08-13 10:56:15.363905"], ["updated_at", "2020-08-13 10:56:15.363905"]]

    def update
        respond_to do |format|
        if @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "hi there I'm typing this today about this topic\r\n"], ["updated_at", "2020-08-13 11:00:00.914841"], ["id", 1]]